#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/ACT-Terraform-Demos/demo-github-actions/runs/run-1xD1v75XyJZ1gXbR

Waiting for the plan to start...

Terraform v1.3.7
on linux_amd64
Initializing plugins and modules...
2023-01-18T05:21:50.928Z [INFO]  Terraform version: 1.3.7
2023-01-18T05:21:50.929Z [DEBUG] using github.com/hashicorp/go-tfe v1.9.0
2023-01-18T05:21:50.929Z [DEBUG] using github.com/hashicorp/hcl/v2 v2.15.0
2023-01-18T05:21:50.929Z [DEBUG] using github.com/hashicorp/terraform-config-inspect v0.0.0-20210209133302-4fd17a0faac2
2023-01-18T05:21:50.929Z [DEBUG] using github.com/hashicorp/terraform-svchost v0.0.0-20200729002733-f050f53b9734
2023-01-18T05:21:50.929Z [DEBUG] using github.com/zclconf/go-cty v1.12.1
2023-01-18T05:21:50.929Z [INFO]  Go runtime version: go1.19.4
2023-01-18T05:21:50.929Z [INFO]  CLI args: []string{"/home/tfc-agent/.tfc-agent/component/terraform/runs/run-1xD1v75XyJZ1gXbR/bin/terraform", "plan", "-out=/home/tfc-agent/.tfc-agent/component/terraform/runs/run-1xD1v75XyJZ1gXbR/config/terraform.tfplan", "-var-file=/home/tfc-agent/.tfc-agent/component/terraform/runs/run-1xD1v75XyJZ1gXbR/terraform.tfvars", "-detailed-exitcode", "-lock=false"}
2023-01-18T05:21:50.929Z [DEBUG] Attempting to open CLI config file: /home/tfc-agent/.tfc-agent/component/terraform/runs/run-1xD1v75XyJZ1gXbR/.terraformrc
2023-01-18T05:21:50.929Z [INFO]  Loading CLI configuration from /home/tfc-agent/.tfc-agent/component/terraform/runs/run-1xD1v75XyJZ1gXbR/.terraformrc
2023-01-18T05:21:50.930Z [DEBUG] checking for credentials in "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-1xD1v75XyJZ1gXbR/.terraform.d/plugins"
2023-01-18T05:21:50.930Z [DEBUG] ignoring non-existing provider search directory terraform.d/plugins
2023-01-18T05:21:50.930Z [DEBUG] will search for provider plugins in /home/tfc-agent/.tfc-agent/component/terraform/runs/run-1xD1v75XyJZ1gXbR/.terraform.d/plugins
2023-01-18T05:21:50.931Z [DEBUG] ignoring non-existing provider search directory /home/tfc-agent/.tfc-agent/component/terraform/runs/run-1xD1v75XyJZ1gXbR/.local/share/terraform/plugins
2023-01-18T05:21:50.931Z [DEBUG] ignoring non-existing provider search directory /usr/local/share/terraform/plugins
2023-01-18T05:21:50.931Z [DEBUG] ignoring non-existing provider search directory /usr/share/terraform/plugins
2023-01-18T05:21:50.932Z [INFO]  CLI command args: []string{"plan", "-out=/home/tfc-agent/.tfc-agent/component/terraform/runs/run-1xD1v75XyJZ1gXbR/config/terraform.tfplan", "-var-file=/home/tfc-agent/.tfc-agent/component/terraform/runs/run-1xD1v75XyJZ1gXbR/terraform.tfvars", "-detailed-exitcode", "-lock=false"}
2023-01-18T05:21:50.934Z [DEBUG] Service discovery for app.terraform.io at https://app.terraform.io/.well-known/terraform.json
2023-01-18T05:21:51.638Z [DEBUG] checking for provisioner in "."
2023-01-18T05:21:51.638Z [DEBUG] checking for provisioner in "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-1xD1v75XyJZ1gXbR/bin"
2023-01-18T05:21:51.638Z [DEBUG] checking for provisioner in "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-1xD1v75XyJZ1gXbR/.terraform.d/plugins"
2023-01-18T05:21:51.684Z [INFO]  backend/local: starting Plan operation
2023-01-18T05:21:51.769Z [DEBUG] backend/local: Skipping interactive prompts for variables because input is disabled
2023-01-18T05:21:51.769Z [DEBUG] Building and walking validate graph
2023-01-18T05:21:51.770Z [DEBUG] ProviderTransformer: "random_pet.sg" (*terraform.NodeValidatableResource) needs provider["registry.terraform.io/hashicorp/random"]
2023-01-18T05:21:51.770Z [DEBUG] ProviderTransformer: "aws_instance.web" (*terraform.NodeValidatableResource) needs provider["registry.terraform.io/hashicorp/aws"]
2023-01-18T05:21:51.770Z [DEBUG] ProviderTransformer: "aws_security_group.web-sg" (*terraform.NodeValidatableResource) needs provider["registry.terraform.io/hashicorp/aws"]
2023-01-18T05:21:51.770Z [DEBUG] created provider logger: level=debug
2023-01-18T05:21:51.770Z [INFO]  provider: configuring client automatic mTLS
2023-01-18T05:21:51.788Z [DEBUG] provider: starting plugin: path=.terraform/providers/registry.terraform.io/hashicorp/random/3.0.1/linux_amd64/terraform-provider-random_v3.0.1_x5 args=[.terraform/providers/registry.terraform.io/hashicorp/random/3.0.1/linux_amd64/terraform-provider-random_v3.0.1_x5]
2023-01-18T05:21:51.791Z [DEBUG] provider: plugin started: path=.terraform/providers/registry.terraform.io/hashicorp/random/3.0.1/linux_amd64/terraform-provider-random_v3.0.1_x5 pid=69
2023-01-18T05:21:51.791Z [DEBUG] provider: waiting for RPC address: path=.terraform/providers/registry.terraform.io/hashicorp/random/3.0.1/linux_amd64/terraform-provider-random_v3.0.1_x5
2023-01-18T05:21:51.808Z [INFO]  provider.terraform-provider-random_v3.0.1_x5: configuring server automatic mTLS: timestamp=2023-01-18T05:21:51.808Z
2023-01-18T05:21:51.840Z [DEBUG] provider.terraform-provider-random_v3.0.1_x5: plugin address: address=/tmp/plugin237918199 network=unix timestamp=2023-01-18T05:21:51.840Z
2023-01-18T05:21:51.840Z [DEBUG] provider: using plugin: version=5
2023-01-18T05:21:51.875Z [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = error reading from server: EOF"
2023-01-18T05:21:51.876Z [DEBUG] provider: plugin process exited: path=.terraform/providers/registry.terraform.io/hashicorp/random/3.0.1/linux_amd64/terraform-provider-random_v3.0.1_x5 pid=69
2023-01-18T05:21:51.876Z [DEBUG] provider: plugin exited
2023-01-18T05:21:51.876Z [DEBUG] created provider logger: level=debug
2023-01-18T05:21:51.876Z [INFO]  provider: configuring client automatic mTLS
2023-01-18T05:21:51.883Z [DEBUG] provider: starting plugin: path=.terraform/providers/registry.terraform.io/hashicorp/aws/3.26.0/linux_amd64/terraform-provider-aws_v3.26.0_x5 args=[.terraform/providers/registry.terraform.io/hashicorp/aws/3.26.0/linux_amd64/terraform-provider-aws_v3.26.0_x5]
2023-01-18T05:21:51.887Z [DEBUG] provider: plugin started: path=.terraform/providers/registry.terraform.io/hashicorp/aws/3.26.0/linux_amd64/terraform-provider-aws_v3.26.0_x5 pid=81
2023-01-18T05:21:51.887Z [DEBUG] provider: waiting for RPC address: path=.terraform/providers/registry.terraform.io/hashicorp/aws/3.26.0/linux_amd64/terraform-provider-aws_v3.26.0_x5
2023-01-18T05:21:51.938Z [INFO]  provider.terraform-provider-aws_v3.26.0_x5: configuring server automatic mTLS: timestamp=2023-01-18T05:21:51.937Z
2023-01-18T05:21:51.967Z [DEBUG] provider: using plugin: version=5
2023-01-18T05:21:51.967Z [DEBUG] provider.terraform-provider-aws_v3.26.0_x5: plugin address: address=/tmp/plugin099853026 network=unix timestamp=2023-01-18T05:21:51.967Z
2023-01-18T05:21:52.100Z [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = error reading from server: EOF"
2023-01-18T05:21:52.100Z [DEBUG] provider: plugin process exited: path=.terraform/providers/registry.terraform.io/hashicorp/aws/3.26.0/linux_amd64/terraform-provider-aws_v3.26.0_x5 pid=81
2023-01-18T05:21:52.100Z [DEBUG] provider: plugin exited
2023-01-18T05:21:52.101Z [DEBUG] ReferenceTransformer: "random_pet.sg" references: []
2023-01-18T05:21:52.101Z [DEBUG] ReferenceTransformer: "aws_instance.web" references: [aws_security_group.web-sg]
2023-01-18T05:21:52.101Z [DEBUG] ReferenceTransformer: "aws_security_group.web-sg" references: [random_pet.sg]
2023-01-18T05:21:52.101Z [DEBUG] ReferenceTransformer: "output.web-address (expand)" references: [aws_instance.web]
2023-01-18T05:21:52.101Z [DEBUG] ReferenceTransformer: "provider[\"registry.terraform.io/hashicorp/random\"]" references: []
2023-01-18T05:21:52.101Z [DEBUG] ReferenceTransformer: "provider[\"registry.terraform.io/hashicorp/aws\"]" references: []
2023-01-18T05:21:52.101Z [DEBUG] Starting graph walk: walkValidate
2023-01-18T05:21:52.102Z [DEBUG] created provider logger: level=debug
2023-01-18T05:21:52.102Z [INFO]  provider: configuring client automatic mTLS
2023-01-18T05:21:52.109Z [DEBUG] provider: starting plugin: path=.terraform/providers/registry.terraform.io/hashicorp/random/3.0.1/linux_amd64/terraform-provider-random_v3.0.1_x5 args=[.terraform/providers/registry.terraform.io/hashicorp/random/3.0.1/linux_amd64/terraform-provider-random_v3.0.1_x5]
2023-01-18T05:21:52.113Z [DEBUG] provider: plugin started: path=.terraform/providers/registry.terraform.io/hashicorp/random/3.0.1/linux_amd64/terraform-provider-random_v3.0.1_x5 pid=102
2023-01-18T05:21:52.113Z [DEBUG] provider: waiting for RPC address: path=.terraform/providers/registry.terraform.io/hashicorp/random/3.0.1/linux_amd64/terraform-provider-random_v3.0.1_x5
2023-01-18T05:21:52.128Z [INFO]  provider.terraform-provider-random_v3.0.1_x5: configuring server automatic mTLS: timestamp=2023-01-18T05:21:52.128Z
2023-01-18T05:21:52.158Z [DEBUG] provider.terraform-provider-random_v3.0.1_x5: plugin address: address=/tmp/plugin151070388 network=unix timestamp=2023-01-18T05:21:52.158Z
2023-01-18T05:21:52.158Z [DEBUG] provider: using plugin: version=5
2023-01-18T05:21:52.192Z [DEBUG] created provider logger: level=debug
2023-01-18T05:21:52.193Z [INFO]  provider: configuring client automatic mTLS
2023-01-18T05:21:52.200Z [DEBUG] provider: starting plugin: path=.terraform/providers/registry.terraform.io/hashicorp/aws/3.26.0/linux_amd64/terraform-provider-aws_v3.26.0_x5 args=[.terraform/providers/registry.terraform.io/hashicorp/aws/3.26.0/linux_amd64/terraform-provider-aws_v3.26.0_x5]
2023-01-18T05:21:52.204Z [DEBUG] provider: plugin started: path=.terraform/providers/registry.terraform.io/hashicorp/aws/3.26.0/linux_amd64/terraform-provider-aws_v3.26.0_x5 pid=115
2023-01-18T05:21:52.204Z [DEBUG] provider: waiting for RPC address: path=.terraform/providers/registry.terraform.io/hashicorp/aws/3.26.0/linux_amd64/terraform-provider-aws_v3.26.0_x5
2023-01-18T05:21:52.260Z [INFO]  provider.terraform-provider-aws_v3.26.0_x5: configuring server automatic mTLS: timestamp=2023-01-18T05:21:52.260Z
2023-01-18T05:21:52.293Z [DEBUG] provider.terraform-provider-aws_v3.26.0_x5: plugin address: address=/tmp/plugin318045711 network=unix timestamp=2023-01-18T05:21:52.293Z
2023-01-18T05:21:52.293Z [DEBUG] provider: using plugin: version=5
2023-01-18T05:21:52.327Z [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = error reading from server: EOF"
2023-01-18T05:21:52.328Z [DEBUG] provider: plugin process exited: path=.terraform/providers/registry.terraform.io/hashicorp/random/3.0.1/linux_amd64/terraform-provider-random_v3.0.1_x5 pid=102
2023-01-18T05:21:52.328Z [DEBUG] provider: plugin exited
2023-01-18T05:21:52.518Z [INFO]  provider.terraform-provider-aws_v3.26.0_x5: 2023/01/18 05:21:52 [WARN] Truncating attribute path of 0 diagnostics for TypeSet: timestamp=2023-01-18T05:21:52.518Z
2023-01-18T05:21:52.518Z [INFO]  provider.terraform-provider-aws_v3.26.0_x5: 2023/01/18 05:21:52 [WARN] Truncating attribute path of 0 diagnostics for TypeSet: timestamp=2023-01-18T05:21:52.518Z
2023-01-18T05:21:52.521Z [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = error reading from server: EOF"
2023-01-18T05:21:52.522Z [DEBUG] provider: plugin process exited: path=.terraform/providers/registry.terraform.io/hashicorp/aws/3.26.0/linux_amd64/terraform-provider-aws_v3.26.0_x5 pid=115
2023-01-18T05:21:52.522Z [DEBUG] provider: plugin exited
2023-01-18T05:21:52.522Z [INFO]  backend/local: plan calling Plan
2023-01-18T05:21:52.522Z [DEBUG] Building and walking plan graph for NormalMode
2023-01-18T05:21:52.523Z [DEBUG] ProviderTransformer: "random_pet.sg (expand)" (*terraform.nodeExpandPlannableResource) needs provider["registry.terraform.io/hashicorp/random"]
2023-01-18T05:21:52.523Z [DEBUG] ProviderTransformer: "aws_instance.web (expand)" (*terraform.nodeExpandPlannableResource) needs provider["registry.terraform.io/hashicorp/aws"]
2023-01-18T05:21:52.523Z [DEBUG] ProviderTransformer: "aws_security_group.web-sg (expand)" (*terraform.nodeExpandPlannableResource) needs provider["registry.terraform.io/hashicorp/aws"]
2023-01-18T05:21:52.524Z [DEBUG] ReferenceTransformer: "aws_instance.web (expand)" references: [aws_security_group.web-sg (expand)]
2023-01-18T05:21:52.524Z [DEBUG] ReferenceTransformer: "aws_security_group.web-sg (expand)" references: [random_pet.sg (expand)]
2023-01-18T05:21:52.524Z [DEBUG] ReferenceTransformer: "output.web-address (expand)" references: [aws_instance.web (expand)]
2023-01-18T05:21:52.524Z [DEBUG] ReferenceTransformer: "provider[\"registry.terraform.io/hashicorp/random\"]" references: []
2023-01-18T05:21:52.524Z [DEBUG] ReferenceTransformer: "provider[\"registry.terraform.io/hashicorp/aws\"]" references: []
2023-01-18T05:21:52.524Z [DEBUG] ReferenceTransformer: "random_pet.sg (expand)" references: []
2023-01-18T05:21:52.526Z [DEBUG] Starting graph walk: walkPlan
2023-01-18T05:21:52.526Z [DEBUG] created provider logger: level=debug
2023-01-18T05:21:52.527Z [INFO]  provider: configuring client automatic mTLS
2023-01-18T05:21:52.534Z [DEBUG] provider: starting plugin: path=.terraform/providers/registry.terraform.io/hashicorp/random/3.0.1/linux_amd64/terraform-provider-random_v3.0.1_x5 args=[.terraform/providers/registry.terraform.io/hashicorp/random/3.0.1/linux_amd64/terraform-provider-random_v3.0.1_x5]
2023-01-18T05:21:52.537Z [DEBUG] provider: plugin started: path=.terraform/providers/registry.terraform.io/hashicorp/random/3.0.1/linux_amd64/terraform-provider-random_v3.0.1_x5 pid=136
2023-01-18T05:21:52.537Z [DEBUG] provider: waiting for RPC address: path=.terraform/providers/registry.terraform.io/hashicorp/random/3.0.1/linux_amd64/terraform-provider-random_v3.0.1_x5
2023-01-18T05:21:52.553Z [INFO]  provider.terraform-provider-random_v3.0.1_x5: configuring server automatic mTLS: timestamp=2023-01-18T05:21:52.553Z
2023-01-18T05:21:52.582Z [DEBUG] provider.terraform-provider-random_v3.0.1_x5: plugin address: address=/tmp/plugin163986001 network=unix timestamp=2023-01-18T05:21:52.582Z
2023-01-18T05:21:52.582Z [DEBUG] provider: using plugin: version=5
2023-01-18T05:21:52.614Z [DEBUG] created provider logger: level=debug
2023-01-18T05:21:52.615Z [INFO]  provider: configuring client automatic mTLS
2023-01-18T05:21:52.622Z [DEBUG] provider: starting plugin: path=.terraform/providers/registry.terraform.io/hashicorp/aws/3.26.0/linux_amd64/terraform-provider-aws_v3.26.0_x5 args=[.terraform/providers/registry.terraform.io/hashicorp/aws/3.26.0/linux_amd64/terraform-provider-aws_v3.26.0_x5]
2023-01-18T05:21:52.626Z [DEBUG] provider: plugin started: path=.terraform/providers/registry.terraform.io/hashicorp/aws/3.26.0/linux_amd64/terraform-provider-aws_v3.26.0_x5 pid=148
2023-01-18T05:21:52.626Z [DEBUG] provider: waiting for RPC address: path=.terraform/providers/registry.terraform.io/hashicorp/aws/3.26.0/linux_amd64/terraform-provider-aws_v3.26.0_x5
2023-01-18T05:21:52.678Z [INFO]  provider.terraform-provider-aws_v3.26.0_x5: configuring server automatic mTLS: timestamp=2023-01-18T05:21:52.678Z
2023-01-18T05:21:52.702Z [DEBUG] provider: using plugin: version=5
2023-01-18T05:21:52.702Z [DEBUG] provider.terraform-provider-aws_v3.26.0_x5: plugin address: address=/tmp/plugin838802832 network=unix timestamp=2023-01-18T05:21:52.702Z
2023-01-18T05:21:52.735Z [DEBUG] Resource instance state not found for node "random_pet.sg", instance random_pet.sg
2023-01-18T05:21:52.735Z [DEBUG] ReferenceTransformer: "random_pet.sg" references: []
2023-01-18T05:21:52.735Z [DEBUG] refresh: random_pet.sg: no state, so not refreshing
2023-01-18T05:21:52.739Z [WARN]  Provider "registry.terraform.io/hashicorp/random" produced an invalid plan for random_pet.sg, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .length: planned value cty.NumberIntVal(2) for a non-computed attribute
      - .separator: planned value cty.StringVal("-") for a non-computed attribute
2023-01-18T05:21:52.740Z [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = error reading from server: EOF"
2023-01-18T05:21:52.741Z [DEBUG] provider: plugin process exited: path=.terraform/providers/registry.terraform.io/hashicorp/random/3.0.1/linux_amd64/terraform-provider-random_v3.0.1_x5 pid=136
2023-01-18T05:21:52.741Z [DEBUG] provider: plugin exited
2023-01-18T05:21:52.885Z [WARN]  ValidateProviderConfig from "provider[\"registry.terraform.io/hashicorp/aws\"]" changed the config value, but that value is unused
2023-01-18T05:21:52.886Z [INFO]  provider.terraform-provider-aws_v3.26.0_x5: 2023/01/18 05:21:52 [INFO] AWS Auth provider used: "EnvProvider": timestamp=2023-01-18T05:21:52.886Z
2023-01-18T05:21:52.886Z [INFO]  provider.terraform-provider-aws_v3.26.0_x5: 2023/01/18 05:21:52 [DEBUG] Trying to get account information via sts:GetCallerIdentity: timestamp=2023-01-18T05:21:52.886Z
2023-01-18T05:21:52.888Z [INFO]  provider.terraform-provider-aws_v3.26.0_x5: 2023/01/18 05:21:52 [DEBUG] [aws-sdk-go] DEBUG: Request sts/GetCallerIdentity Details:
---[ REQUEST POST-SIGN ]-----------------------------
POST / HTTP/1.1
Host: sts.amazonaws.com
User-Agent: aws-sdk-go/1.37.0 (go1.15.5; linux; amd64) APN/1.0 HashiCorp/1.0 Terraform/1.3.7 (+https://www.terraform.io)
Content-Length: 43
Authorization: AWS4-HMAC-SHA256 Credential=AKIAUQDIWPF747OPMC53/20230118/us-east-1/sts/aws4_request, SignedHeaders=content-length;content-type;host;x-amz-date, Signature=5c3564cdf7ddcf7ded422c7c3e27b890ce663ae318c830e223e51453a65cf735
Content-Type: application/x-www-form-urlencoded; charset=utf-8
X-Amz-Date: 20230118T052152Z
Accept-Encoding: gzip

Action=GetCallerIdentity&Version=2011-06-15
-----------------------------------------------------: timestamp=2023-01-18T05:21:52.887Z
2023-01-18T05:21:52.924Z [INFO]  provider.terraform-provider-aws_v3.26.0_x5: 2023/01/18 05:21:52 [DEBUG] [aws-sdk-go] DEBUG: Response sts/GetCallerIdentity Details:
---[ RESPONSE ]--------------------------------------
HTTP/1.1 200 OK
Connection: close
Content-Length: 407
Content-Type: text/xml
Date: Wed, 18 Jan 2023 05:21:52 GMT
X-Amzn-Requestid: c10b3c2d-df9f-44b4-b8bf-42248bf6f515


-----------------------------------------------------: timestamp=2023-01-18T05:21:52.924Z
2023-01-18T05:21:52.924Z [INFO]  provider.terraform-provider-aws_v3.26.0_x5: 2023/01/18 05:21:52 [DEBUG] [aws-sdk-go] <GetCallerIdentityResponse xmlns="https://sts.amazonaws.com/doc/2011-06-15/">
  <GetCallerIdentityResult>
    <Arn>arn:aws:iam::309457222015:user/cloud_user</Arn>
    <UserId>AIDAUQDIWPF73WNRR5PPF</UserId>
    <Account>309457222015</Account>
  </GetCallerIdentityResult>
  <ResponseMetadata>
    <RequestId>c10b3c2d-df9f-44b4-b8bf-42248bf6f515</RequestId>
  </ResponseMetadata>
</GetCallerIdentityResponse>: timestamp=2023-01-18T05:21:52.924Z
2023-01-18T05:21:52.924Z [INFO]  provider.terraform-provider-aws_v3.26.0_x5: 2023/01/18 05:21:52 [DEBUG] Trying to get account information via sts:GetCallerIdentity: timestamp=2023-01-18T05:21:52.924Z
2023-01-18T05:21:52.924Z [INFO]  provider.terraform-provider-aws_v3.26.0_x5: 2023/01/18 05:21:52 [DEBUG] [aws-sdk-go] DEBUG: Request sts/GetCallerIdentity Details:
---[ REQUEST POST-SIGN ]-----------------------------
POST / HTTP/1.1
Host: sts.amazonaws.com
User-Agent: aws-sdk-go/1.37.0 (go1.15.5; linux; amd64) APN/1.0 HashiCorp/1.0 Terraform/1.3.7 (+https://www.terraform.io)
Content-Length: 43
Authorization: AWS4-HMAC-SHA256 Credential=AKIAUQDIWPF747OPMC53/20230118/us-east-1/sts/aws4_request, SignedHeaders=content-length;content-type;host;x-amz-date, Signature=5c3564cdf7ddcf7ded422c7c3e27b890ce663ae318c830e223e51453a65cf735
Content-Type: application/x-www-form-urlencoded; charset=utf-8
X-Amz-Date: 20230118T052152Z
Accept-Encoding: gzip

Action=GetCallerIdentity&Version=2011-06-15
-----------------------------------------------------: timestamp=2023-01-18T05:21:52.924Z
2023-01-18T05:21:52.944Z [INFO]  provider.terraform-provider-aws_v3.26.0_x5: 2023/01/18 05:21:52 [DEBUG] [aws-sdk-go] DEBUG: Response sts/GetCallerIdentity Details:
---[ RESPONSE ]--------------------------------------
HTTP/1.1 200 OK
Connection: close
Content-Length: 407
Content-Type: text/xml
Date: Wed, 18 Jan 2023 05:21:52 GMT
X-Amzn-Requestid: 910c0b99-ff30-4257-8bd7-d5a85db9aec4


-----------------------------------------------------: timestamp=2023-01-18T05:21:52.944Z
2023-01-18T05:21:52.944Z [INFO]  provider.terraform-provider-aws_v3.26.0_x5: 2023/01/18 05:21:52 [DEBUG] [aws-sdk-go] <GetCallerIdentityResponse xmlns="https://sts.amazonaws.com/doc/2011-06-15/">
  <GetCallerIdentityResult>
    <Arn>arn:aws:iam::309457222015:user/cloud_user</Arn>
    <UserId>AIDAUQDIWPF73WNRR5PPF</UserId>
    <Account>309457222015</Account>
  </GetCallerIdentityResult>
  <ResponseMetadata>
    <RequestId>910c0b99-ff30-4257-8bd7-d5a85db9aec4</RequestId>
  </ResponseMetadata>
</GetCallerIdentityResponse>: timestamp=2023-01-18T05:21:52.944Z
2023-01-18T05:21:52.946Z [INFO]  provider.terraform-provider-aws_v3.26.0_x5: 2023/01/18 05:21:52 [DEBUG] [aws-sdk-go] DEBUG: Request ec2/DescribeAccountAttributes Details:
---[ REQUEST POST-SIGN ]-----------------------------
POST / HTTP/1.1
Host: ec2.us-west-1.amazonaws.com
User-Agent: aws-sdk-go/1.37.0 (go1.15.5; linux; amd64) APN/1.0 HashiCorp/1.0 Terraform/1.3.7 (+https://www.terraform.io)
Content-Length: 87
Authorization: AWS4-HMAC-SHA256 Credential=AKIAUQDIWPF747OPMC53/20230118/us-west-1/ec2/aws4_request, SignedHeaders=content-length;content-type;host;x-amz-date, Signature=fd1c341df9c81b4a80fcaca2afe4ebac5aa0a5e66c0fadcbef72a31515b37fd0
Content-Type: application/x-www-form-urlencoded; charset=utf-8
X-Amz-Date: 20230118T052152Z
Accept-Encoding: gzip

Action=DescribeAccountAttributes&AttributeName.1=supported-platforms&Version=2016-11-15
-----------------------------------------------------: timestamp=2023-01-18T05:21:52.946Z
2023-01-18T05:21:53.239Z [INFO]  provider.terraform-provider-aws_v3.26.0_x5: 2023/01/18 05:21:53 [DEBUG] [aws-sdk-go] DEBUG: Response ec2/DescribeAccountAttributes Details:
---[ RESPONSE ]--------------------------------------
HTTP/1.1 403 Forbidden
Connection: close
Transfer-Encoding: chunked
Cache-Control: no-cache, no-store
Content-Type: text/xml;charset=UTF-8
Date: Wed, 18 Jan 2023 05:21:52 GMT
Keep-Alive: timeout=20
Server: AmazonEC2
Strict-Transport-Security: max-age=31536000; includeSubDomains
Vary: accept-encoding
X-Amzn-Requestid: cb24a51c-32c7-431a-b2cb-5d6fe37d9742


-----------------------------------------------------: timestamp=2023-01-18T05:21:53.239Z
2023-01-18T05:21:53.239Z [INFO]  provider.terraform-provider-aws_v3.26.0_x5: 2023/01/18 05:21:53 [DEBUG] [aws-sdk-go] <?xml version="1.0" encoding="UTF-8"?>
<Response><Errors><Error><Code>UnauthorizedOperation</Code><Message>You are not authorized to perform this operation.</Message></Error></Errors><RequestID>cb24a51c-32c7-431a-b2cb-5d6fe37d9742</RequestID></Response>: timestamp=2023-01-18T05:21:53.239Z
2023-01-18T05:21:53.239Z [INFO]  provider.terraform-provider-aws_v3.26.0_x5: 2023/01/18 05:21:53 [DEBUG] [aws-sdk-go] DEBUG: Validate Response ec2/DescribeAccountAttributes failed, attempt 0/25, error UnauthorizedOperation: You are not authorized to perform this operation.
	status code: 403, request id: cb24a51c-32c7-431a-b2cb-5d6fe37d9742: timestamp=2023-01-18T05:21:53.239Z
2023-01-18T05:21:53.239Z [INFO]  provider.terraform-provider-aws_v3.26.0_x5: 2023/01/18 05:21:53 [WARN] Unable to get supported EC2 platforms: UnauthorizedOperation: You are not authorized to perform this operation.
	status code: 403, request id: cb24a51c-32c7-431a-b2cb-5d6fe37d9742: timestamp=2023-01-18T05:21:53.239Z
2023-01-18T05:21:53.240Z [DEBUG] Resource instance state not found for node "aws_security_group.web-sg", instance aws_security_group.web-sg
2023-01-18T05:21:53.240Z [DEBUG] ReferenceTransformer: "aws_security_group.web-sg" references: []
2023-01-18T05:21:53.240Z [DEBUG] refresh: aws_security_group.web-sg: no state, so not refreshing
2023-01-18T05:21:53.242Z [INFO]  provider.terraform-provider-aws_v3.26.0_x5: 2023/01/18 05:21:53 [WARN] Truncating attribute path of 0 diagnostics for TypeSet: timestamp=2023-01-18T05:21:53.242Z
2023-01-18T05:21:53.242Z [INFO]  provider.terraform-provider-aws_v3.26.0_x5: 2023/01/18 05:21:53 [WARN] Truncating attribute path of 0 diagnostics for TypeSet: timestamp=2023-01-18T05:21:53.242Z
2023-01-18T05:21:53.244Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_security_group.web-sg, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .description: planned value cty.StringVal("Managed by Terraform") for a non-computed attribute
      - .ingress: planned value cty.SetVal([]cty.Value{cty.ObjectVal(map[string]cty.Value{"cidr_blocks":cty.ListVal([]cty.Value{cty.StringVal("0.0.0.0/0")}), "description":cty.StringVal(""), "from_port":cty.NumberIntVal(8080), "ipv6_cidr_blocks":cty.ListValEmpty(cty.String), "prefix_list_ids":cty.ListValEmpty(cty.String), "protocol":cty.StringVal("tcp"), "security_groups":cty.SetValEmpty(cty.String), "self":cty.False, "to_port":cty.NumberIntVal(8080)})}) does not match config value cty.SetVal([]cty.Value{cty.ObjectVal(map[string]cty.Value{"cidr_blocks":cty.ListVal([]cty.Value{cty.StringVal("0.0.0.0/0")}), "description":cty.NullVal(cty.String), "from_port":cty.NumberIntVal(8080), "ipv6_cidr_blocks":cty.NullVal(cty.List(cty.String)), "prefix_list_ids":cty.NullVal(cty.List(cty.String)), "protocol":cty.StringVal("tcp"), "security_groups":cty.NullVal(cty.Set(cty.String)), "self":cty.NullVal(cty.Bool), "to_port":cty.NumberIntVal(8080)})})
      - .revoke_rules_on_delete: planned value cty.False for a non-computed attribute
      - .egress: planned value cty.SetVal([]cty.Value{cty.ObjectVal(map[string]cty.Value{"cidr_blocks":cty.ListVal([]cty.Value{cty.StringVal("0.0.0.0/0")}), "description":cty.StringVal(""), "from_port":cty.NumberIntVal(0), "ipv6_cidr_blocks":cty.ListValEmpty(cty.String), "prefix_list_ids":cty.ListValEmpty(cty.String), "protocol":cty.StringVal("-1"), "security_groups":cty.SetValEmpty(cty.String), "self":cty.False, "to_port":cty.NumberIntVal(0)})}) does not match config value cty.SetVal([]cty.Value{cty.ObjectVal(map[string]cty.Value{"cidr_blocks":cty.ListVal([]cty.Value{cty.StringVal("0.0.0.0/0")}), "description":cty.NullVal(cty.String), "from_port":cty.NumberIntVal(0), "ipv6_cidr_blocks":cty.NullVal(cty.List(cty.String)), "prefix_list_ids":cty.NullVal(cty.List(cty.String)), "protocol":cty.StringVal("-1"), "security_groups":cty.NullVal(cty.Set(cty.String)), "self":cty.NullVal(cty.Bool), "to_port":cty.NumberIntVal(0)})})
2023-01-18T05:21:53.245Z [DEBUG] Resource instance state not found for node "aws_instance.web", instance aws_instance.web
2023-01-18T05:21:53.245Z [DEBUG] ReferenceTransformer: "aws_instance.web" references: []
2023-01-18T05:21:53.245Z [DEBUG] refresh: aws_instance.web: no state, so not refreshing
2023-01-18T05:21:53.248Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_instance.web, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .source_dest_check: planned value cty.True for a non-computed attribute
      - .get_password_data: planned value cty.False for a non-computed attribute
      - .vpc_security_group_ids: planned value cty.UnknownVal(cty.Set(cty.String)) does not match config value cty.SetVal([]cty.Value{cty.UnknownVal(cty.String)})
      - .user_data: planned value cty.StringVal("d36263b945850b1251dc22e4ed5c62aeb9e9e0f0") does not match config value cty.StringVal("#!/bin/bash\napt-get update\napt-get install -y apache2\nsed -i -e 's/80/8080/' /etc/apache2/ports.conf\necho \"Hello World\" > /var/www/html/index.html\nsystemctl restart apache2\n")
      - .root_block_device: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .ebs_block_device: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .enclave_options: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .ephemeral_block_device: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .metadata_options: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .network_interface: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
2023-01-18T05:21:53.250Z [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = error reading from server: EOF"
2023-01-18T05:21:53.250Z [DEBUG] provider: plugin process exited: path=.terraform/providers/registry.terraform.io/hashicorp/aws/3.26.0/linux_amd64/terraform-provider-aws_v3.26.0_x5 pid=148
2023-01-18T05:21:53.251Z [DEBUG] provider: plugin exited
2023-01-18T05:21:53.251Z [DEBUG] building apply graph to check for errors
2023-01-18T05:21:53.251Z [DEBUG] Resource state not found for node "random_pet.sg", instance random_pet.sg
2023-01-18T05:21:53.251Z [DEBUG] Resource state not found for node "aws_security_group.web-sg", instance aws_security_group.web-sg
2023-01-18T05:21:53.251Z [DEBUG] Resource state not found for node "aws_instance.web", instance aws_instance.web
2023-01-18T05:21:53.251Z [DEBUG] ProviderTransformer: "aws_security_group.web-sg (expand)" (*terraform.nodeExpandApplyableResource) needs provider["registry.terraform.io/hashicorp/aws"]
2023-01-18T05:21:53.251Z [DEBUG] ProviderTransformer: "random_pet.sg" (*terraform.NodeApplyableResourceInstance) needs provider["registry.terraform.io/hashicorp/random"]
2023-01-18T05:21:53.252Z [DEBUG] ProviderTransformer: "aws_instance.web" (*terraform.NodeApplyableResourceInstance) needs provider["registry.terraform.io/hashicorp/aws"]
2023-01-18T05:21:53.252Z [DEBUG] ProviderTransformer: "random_pet.sg (expand)" (*terraform.nodeExpandApplyableResource) needs provider["registry.terraform.io/hashicorp/random"]
2023-01-18T05:21:53.252Z [DEBUG] ProviderTransformer: "aws_instance.web (expand)" (*terraform.nodeExpandApplyableResource) needs provider["registry.terraform.io/hashicorp/aws"]
2023-01-18T05:21:53.252Z [DEBUG] ProviderTransformer: "aws_security_group.web-sg" (*terraform.NodeApplyableResourceInstance) needs provider["registry.terraform.io/hashicorp/aws"]
2023-01-18T05:21:53.252Z [DEBUG] ReferenceTransformer: "aws_security_group.web-sg (expand)" references: []
2023-01-18T05:21:53.252Z [DEBUG] ReferenceTransformer: "random_pet.sg" references: []
2023-01-18T05:21:53.252Z [DEBUG] ReferenceTransformer: "aws_instance.web" references: [aws_security_group.web-sg (expand) aws_security_group.web-sg aws_security_group.web-sg]
2023-01-18T05:21:53.252Z [DEBUG] ReferenceTransformer: "provider[\"registry.terraform.io/hashicorp/random\"]" references: []
2023-01-18T05:21:53.252Z [DEBUG] ReferenceTransformer: "provider[\"registry.terraform.io/hashicorp/aws\"]" references: []
2023-01-18T05:21:53.252Z [DEBUG] ReferenceTransformer: "random_pet.sg (expand)" references: []
2023-01-18T05:21:53.252Z [DEBUG] ReferenceTransformer: "aws_instance.web (expand)" references: []
2023-01-18T05:21:53.252Z [DEBUG] ReferenceTransformer: "output.web-address (expand)" references: [aws_instance.web aws_instance.web aws_instance.web (expand)]
2023-01-18T05:21:53.252Z [DEBUG] ReferenceTransformer: "aws_security_group.web-sg" references: [random_pet.sg random_pet.sg random_pet.sg (expand)]
2023-01-18T05:21:53.253Z [INFO]  backend/local: plan operation completed
2023-01-18T05:21:53.253Z [INFO]  backend/local: writing plan output to: /home/tfc-agent/.tfc-agent/component/terraform/runs/run-1xD1v75XyJZ1gXbR/config/terraform.tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_instance.web will be created
  + resource "aws_instance" "web" {
      + ami                          = "ami-0cba0b4035dacbd55"
      + arn                          = (known after apply)
      + associate_public_ip_address  = (known after apply)
      + availability_zone            = (known after apply)
      + cpu_core_count               = (known after apply)
      + cpu_threads_per_core         = (known after apply)
      + get_password_data            = false
      + host_id                      = (known after apply)
      + id                           = (known after apply)
      + instance_state               = (known after apply)
      + instance_type                = "t2.micro"
      + ipv6_address_count           = (known after apply)
      + ipv6_addresses               = (known after apply)
      + key_name                     = (known after apply)
      + outpost_arn                  = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      + primary_network_interface_id = (known after apply)
      + private_dns                  = (known after apply)
      + private_ip                   = (known after apply)
      + public_dns                   = (known after apply)
      + public_ip                    = (known after apply)
      + secondary_private_ips        = (known after apply)
      + security_groups              = (known after apply)
      + source_dest_check            = true
      + subnet_id                    = (known after apply)
      + tenancy                      = (known after apply)
      + user_data                    = "d36263b945850b1251dc22e4ed5c62aeb9e9e0f0"
      + vpc_security_group_ids       = (known after apply)

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # aws_security_group.web-sg will be created
  + resource "aws_security_group" "web-sg" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 8080
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 8080
            },
        ]
      + name                   = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + vpc_id                 = (known after apply)
    }

  # random_pet.sg will be created
  + resource "random_pet" "sg" {
      + id        = (known after apply)
      + length    = 2
      + separator = "-"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + web-address = (known after apply)

```

</details>

*Pushed by: @dassiorleando, Action: `pull_request`*